Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཆོས་ལ་མོས་པའི་རྣལ་འབྱོར་ལ་བརྩོན་པར་བྱའོ།
en: They should engage with the practice of appreciating the Dharma.

source: །དེ་ལ་ཆོས་གང་ཞེ་ན། ཆོས་ཐམས་ཅད་དབྱེར་མེད་པ་སྟེ། འདི་ནི་ཆོས་ཞེས་བྱའོ།
en: In this regard, if you ask what the Dharma is, the indivisibility of all phenomena is called the Dharma.

source: །དེ་ལ་ཆོས་འདོད་པ་གང་ཞེ་ན། གང་ཆོས་དེ་ལ་འདོད་ཅིང་མོས་པ་སྟེ། འདི་ནི་ཆོས་འདོད་པ་ཞེས་བྱའོ།
en: If you ask what wishing for the Dharma is, wishing for and devotion to any [causal or fruitional] attribute is called the appreciation of the Dharma.

source: །དེ་ལ་ཆོས་ལ་དགའ་བ་གང་ཞེ་ན། ཆོས་དེ་ལ་དགའ་ཞིང་མངོན་པར་དགའ་བ་སྟེ། འདི་ནི་ཆོས་ལ་དགའ་བ་ཞེས་བྱའོ།
en: If you ask what rejoicing in the Dharma is, joy and pleasure in the Dharma is called rejoicing in the Dharma.

source: །དེ་ལ་ཆོས་ལ་མོས་པ་གང་ཞེ་ན། གང་ཆོས་དེ་ལ་ཡོན་ཏན་དུ་ལྟ་བ་སྟེ། འདི་ནི་ཆོས་ལ་མོས་པ་ཞེས་བྱའོ།
en: If you ask what appreciating the Dharma is, seeing the good qualities of any [causal or fruitional] attribute is called appreciating the Dharma.

source: །དེ་ལ་ཆོས་ལ་མོས་པའི་རྣལ་འབྱོར་ལ་བརྩོན་པ་གང་ཞེ་ན། ཆོས་དེ་ཉིད་ལ་བསྒོམ་ཞིང་མང་དུ་བྱེད་པ་སྟེ། འདི་ནི་ཆོས་ལ་མོས་པའི་རྣལ་འབྱོར་ལ་བརྩོན་པ་ཞེས་བྱའོ།
en: If you ask what engaging with the practice of appreciating the Dharma is, cultivating and magnifying those very attributes is called with the practice of appreciating the Dharma.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། སེམས་ཅན་གྱི་ཕུང་པོ་ཆེན་པོ་ངེས་པའི་ཕུལ་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། ནང་སྟོང་པ་ཉིད་ལ་གནས། ཕྱི་སྟོང་པ་ཉིད་ལ་གནས།
en: Subhūti, bodhisattva great beings who practice the perfection of wisdom should lead the great category of beings whose receptivity is certain to their consummation, without apprehending anything. “

source: ཕྱི་ནང་སྟོང་པ་ཉིད་ལ་གནས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་གནས་ཏེ། སེམས་ཅན་གྱི་ཕུང་པོ་ཆེན་པོ་ངེས་པའི་ཕུལ་དུ་འགྱུར་བར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་གནས། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་རྣམས་དང་།
en: Moreover, Subhūti, bodhisattva great beings who practice the perfection of wisdom should lead the great category of beings whose receptivity is certain to their consummation, without apprehending anything, while abiding in the emptiness of internal phenomena, while abiding in the emptiness of external phenomena, while abiding in the emptiness of external and internal phenomena, and while abiding in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities. “

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་གནས་ཏེ། སེམས་ཅན་གྱི་ཕུང་པོ་ཆེན་པོ་ངེས་པའི་ཕུལ་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་འགྱུར་པར་བྱའོ།
en: Moreover, Subhūti, bodhisattva great beings who practice the perfection of wisdom should lead the great category of beings whose receptivity is certain to their consummation, without apprehending anything, while abiding in the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas. {

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལ་གནས། ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པས་རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་བར་ལ་གནས་ཏེ། སེམས་ཅན་གྱི་ཕུང་པོ་ཆེན་པོ་ངེས་པའི་ཕུལ་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་འགྱུར་བར་བྱའོ།
en: Dt.172} “Moreover, Subhūti, bodhisattva great beings who practice the perfection of wisdom should lead the great category of beings whose receptivity is certain to their consummation, without apprehending anything, while abiding in the meditative stability named heroic valor, and [in the other hundred and eighteen meditative stabilities], up to and including the meditative stability named unattached, liberated, and uncovered like space. “

source: །རབ་འབྱོར་ཆོས་དེ་དག་ལ་གནས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ། སེམས་ཅན་གྱི་ཕུང་པོ་ཆེན་པོ་ངེས་པའི་ཕུལ་དུ་བྱེད་པས།
en: Abiding in these attributes, Subhūti, bodhisattva great beings practice the perfection of wisdom, and they lead the great category of beings whose receptivity is certain to their consummation.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བྱའོ།
en: This is why they are called bodhisattva great beings.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དོན་གང་གི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་བ་འདི་ལ་བདག་ཀྱང་སྤོབས་པ་སྐྱེའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then, the venerable Śāradvatīputra declared, “Blessed Lord, I too am inspired to say why bodhisattvas are called great beings.” “

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་སྤོབས་པ་སྐྱེད་ཅིག །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཏུ་ལྟ་བ་དང་། སེམས་ཅན་དུ་ལྟ་བ་དང་། སྲོག་ཏུ་ལྟ་བ་དང་། གང་ཟག་ཏུ་ལྟ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་།
en: Śāradvatīputra, be inspired to speak of that!”

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོར་ལྟ་བ་དང་། ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བ་དང་། ཡོད་པར་ལྟ་བ་དང་། མེད་པར་ལྟ་བ་དང་། ཕུང་པོར་ལྟ་བ་དང་། ཁམས་སུ་ལྟ་བ་དང་། སྐྱེ་མཆེད་དུ་ལྟ་བ་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་ལྟ་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུ་ལྟ་བ་དང་།
en: replied the Blessed One. “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་བར་དུ་ལྟ་བ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བར་ལྟ་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བར་ལྟ་བ་དང་། བྱང་ཆུབ་ཏུ་ལྟ་བ་དང་། སངས་རྒྱས་སུ་ལྟ་བ་དང་། ཆོས་སུ་ལྟ་བ་དང་། དགེ་འདུན་དུ་ལྟ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་ལྟ་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ལྟ་བ་རབ་ཏུ་སྤང་བའི་སླད་དུ་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་བགྱིད་ཀྱང་།
en: Blessed Lord,” said Śāradvatīputra, “although bodhisattva great beings teach the Dharma to beings in order that they might abandon their view of self; their view of sentient beings; their view of life forms; their view of individuals; their views of life, living creatures, people, human beings, actors, experiencers, knowers, and viewers; their nihilist views; their eternalist views; their views of existence; their views of nonexistence; their view of the psycho-physical aggregates; their view of the sensory elements; their view of the sense fields; their view of dependent origination; their views of the perfections and the factors conducive to enlightenment; their views [of the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas; their view of beings to be matured; their view of buddhafields to be refined; their view of enlightenment; their view of the Buddha; their view of the Dharma; their view of the Saṅgha; their view concerning the turning of the doctrinal wheel; and their view concerning the attainment of final nirvāṇa, in all these cases, they do so without apprehending anything.

source: དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་བགྱིད་དེ། དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱིའོ།
en: This is why they are called bodhisattva great beings.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཅིའི་ཕྱིར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་སུ་ལྟ་བར་འགྱུར་བ་ཡིན།
en: Then the venerable Subhūti asked the venerable Śāradvatīputra, “Venerable Śāradvatīputra, why would bodhisattva great beings have a view concerning physical forms?

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་ལྟ་བར་འགྱུར་བ་ཡིན།
en: Why would they have a view concerning feelings, perceptions, formative predispositions, and consciousness?

source: མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ལྟ་བར་འགྱུར་བ་ཡིན།
en: Why would they have views about [the attributes and attainments], up to and including a view concerning the attainment of final nirvāṇa?” “

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཐབས་མི་མཁས་པས། གཟུགས་ལ་དམིགས་ཤིང་། དམིགས་པའི་ཚུལ་གྱིས་ལྟ་བ་སྐྱེད་དོ།
en: Venerable Subhūti, in this regard, bodhisattva great beings who practice the perfection of wisdom without skill in means apprehend physical forms and develop a view of them by way of apprehending.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་དམིགས་ཤིང་། དམིགས་པའི་ཚུལ་གྱིས་ལྟ་བ་སྐྱེད་དོ།
en: They apprehend feelings, perceptions, formative predispositions, and consciousness and develop a view of them by way of apprehending.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བར་དམིགས་ཤིང་། དམིགས་པའི་ཚུལ་གྱིས་ལྟ་བ་སྐྱེད་དོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: They apprehend the sense fields, the sensory elements, and the links of dependent origination, and develop a view of them by way of apprehending.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པར་དམིགས་ཤིང་། དམིགས་པའི་ཚུལ་གྱིས་ལྟ་བ་སྐྱེད་དོ། །རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: They apprehend the perfections, all the aspects of emptiness, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions, and develop a view of them by way of apprehending.

source: གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པར་དམིགས་ཤིང་། དམིགས་པའི་ཚུལ་གྱིས་ལྟ་བ་སྐྱེད་དོ། །ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་དམིགས་ཤིང་། དམིགས་པའི་ཚུལ་གྱིས་ལྟ་བ་སྐྱེད་དོ།
en: They apprehend the aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the gateways of the meditative stabilities and the dhāraṇīs, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas, and develop a view of them by way of apprehending.

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུགས་སུ་ལྟ་བར་འགྱུར་བ་ཡིན། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་ལྟ་བར་འགྱུར་བ་ཡིན།
en: Those, Venerable Subhūti, are the formulations explaining how bodhisattva great beings [who are unskilled] have a view concerning physical forms, they have a view concerning feelings, perceptions, formative predispositions, and consciousness, and they have views concerning [all phenomena, attributes, and attainments], up to and including the attainment of final nirvāṇa.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་བར་དུ་ལྟ་བར་འགྱུར་བ་ཡིན་ཏེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས། ལྟ་བའི་རྣམ་པ་དེ་དག་སྤང་བའི་ཕྱིར། མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་སྟོན་ཏོ།
en: However, when bodhisattva great beings who are skilled in means practice the perfection of wisdom, they teach the Dharma, without apprehending anything, in order that those views might be abandoned.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དོན་གང་གི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་བ་དེ་ལ་བདག་ཀྱང་སྤོབས་པ་སྐྱེའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then the venerable Subhūti declared to the Blessed One, “Blessed Lord, I too am inspired to say why a bodhisattva is called a great being.” “

source: རབ་འབྱོར་ཁྱོད་ཀྱིས་སྤོབས་པ་སྐྱེད་ཅིག །
en: Subhūti, be inspired to speak of that!”

source: རབ་འབྱོར་གྱིས་གསོལ་པ།
en: replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སེམས་མི་མཉམ་པ་དང་མཉམ་པའི་སེམས། ཉན་ཐོས་དང་།
en: Blessed Lord,” said Subhūti, “the enlightened mind is a mind that is equal to the unequaled, and it is not shared in common with any śrāvakas and pratyekabuddhas. {

source: རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ལགས་པའི་སེམས་དེ་ལྟ་བུ་ལ་ཡང་ཆགས་པ་མ་མཆིས་པས། དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱིའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དེ་ནི།
en: Dt.173} Since they are without attachment to such a mind, it is for that reason that bodhisattvas are called great beings.

source: ཟག་པ་མ་མཆིས་ཤིང་ཁམས་གསུམ་གྱི་ཁོངས་སུ་ཆུད་པ་མ་མཆིས་པ་སྟེ། དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཟག་པ་མ་མཆིས་ཤིང་། ཁམས་གསུམ་གྱི་ཁོངས་སུ་ཆུད་པ་མ་མཆིས་པའི་སེམས་དེ་ལ་ཡང་། རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་སླད་དུ་ཆགས་པ་མ་མཆིས་པས། དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་དཔའ་ཆེན་པོའི་གྲངས་སུ་མཆིའོ།
en: If one were to ask why, it is this: that mind set on all-aspect omniscience is free from contaminants and is not part of the three realms, and moreover—owing to the emptiness of inherent existence—bodhisattvas have no attachment to that uncontaminated mind set on all-aspect omniscience that is not part of the three realms; therefore bodhisattvas are reckoned to be great beings.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་སེམས་ནི་སེམས་མ་མཆིས་པ་སྟེ། སེམས་མ་མཆིས་པ་དེ་ལ་ཡང་ཆགས་པ་མ་མཆིས་སོ།
en: So if one were to ask why, it is because that mind is not mind and there is indeed no attachment to that which is not mind.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མི་མཉམ་པ་དང་མཉམ་པའི་སེམས། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པའི་སེམས་གང་ཡིན།
en: Then the venerable Śāradvatīputra asked the venerable Subhūti, “Venerable Subhūti, what is the mind of bodhisattva great beings that is equal to the unequaled, and that is not shared in common with the śrāvakas and pratyekabuddhas?”

source: རབ་འབྱོར་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་ཕྱིན་ཆད་ཆོས་གང་ཡང་སྐྱེ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། འགག་པ་དང་། འཕེལ་བ་དང་། འགྲིབ་པ་དང་། འོང་བ་དང་། འགྲོ་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གང་ལ་སྐྱེ་བ་མེད་ཅིང་། འགག་པ་མེད་པ་དང་།
en: Subhūti replied, “In this regard, Venerable Śāradvatīputra, bodhisattva great beings, starting from the time when they first begin to set their mind on enlightenment, do not observe anything at all that is arising, and they do not observe anything at all that is ceasing, increasing or decreasing, coming or going, defiled or purified.

source: འཕེལ་བ་མེད་ཅིང་འགྲིབ་པ་མེད་པ་དང་། འོང་བ་མེད་ཅིང་འགྲོ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་ཅིང་རྣམ་པར་བྱང་བ་མེད་པ་དེ་ལ། ཉན་ཐོས་ཀྱི་སེམས་མེད་དོ། །རང་སངས་རྒྱས་ཀྱི་སེམས་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་སེམས་མེད་དོ།
en: Venerable Śāradvatīputra, there is nothing that arises or ceases, nothing that increases or decreases, nothing that comes or goes, nothing that is defiled or purified, and nothing that is [identified with] the minds of the śrāvakas, the minds of the pratyekabuddhas, the minds of the bodhisattvas, or the minds of the completely awakened buddhas.

source: །ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་སེམས་མེད་དོ། །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་མི་མཉམ་པ་དང་མཉམ་པ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ཐུན་མོང་མ་ཡིན་པའི་སེམས་སོ། །སྨྲས་པ།
en: Venerable Śāradvatīputra, this is the mind of bodhisattva great beings—equal to the unequaled, and not shared in common with all śrāvakas and pratyekabuddhas.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་ཟག་པ་མེད་པ། ཁོངས་སུ་ཆུད་པ་མེད་པ། དེ་ལྟ་བུའི་སེམས་ལ་ཡང་ཆགས་པ་མེད་དོ་ཞེས་སྨྲས་པ་ནི་དེ་ལྟ་ཡིན་ཏེ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་བས་གཟུགས་ཀྱང་ཆགས་པ་མེད་དོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་ཆགས་པ་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་ཆགས་པ་མེད་དོ།
en: Venerable Subhūti, with regard to your comments that the mind set on all-aspect omniscience is free from contaminants and not part of [the three realms], and that [bodhisattvas] are indeed without attachment to a mind such as this, Venerable Subhūti, it follows that they would also on that basis be without attachment to physical forms, and they would also be without attachment to feelings, perceptions, formative predispositions, and consciousness.” “

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Venerable Śāradvatīputra, that is so!

source: གཟུགས་ཀྱང་ཆགས་པ་མེད་དོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་ཆགས་པ་མེད་དོ།
en: They are also without attachment to physical forms, and they are also without attachment to feelings, perceptions, formative predispositions, and consciousness.

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཡང་ཆགས་པ་མེད་དོ།
en: They are also without attachment to the sense fields, the sensory elements, and the links of dependent origination.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་ཡང་ཆགས་པ་མེད་དོ།
en: They are also without attachment to the [causal attributes], up to and including the factors conducive to enlightenment.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ཡང་ཆགས་པ་མེད་དོ།
en: They are also without attachment to [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་ཆགས་པ་མེད་དོ། །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཁྱོད་ཀྱིས་འདི་སྐད་དུ།
en: They are also without attachment to [the attainments], up to and including all-aspect omniscience.” “

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དེ་ཡང་ཟག་པ་མེད་ཅིང་། ཁོངས་སུ་ཆུད་པ་མེད་དེ་ཞེས་སྨྲས་པ་ནི་དེ་ལྟ་ཡིན་ཏེ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེར་ཡང་མི་ཟད་དེ། བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་སེམས་ཀྱང་། རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: Venerable Subhūti, with regard to your comments that this mind set on all-aspect omniscience is indeed free from contaminants and excluded [from the three realms], not only that follows, Venerable Subhūti, but [it follows that] the minds of ordinary persons{Dt.174} would also be free from contaminants and excluded from the three realms, owing to the emptiness of inherent existence.

source: །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་སེམས་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་ཀྱང་། རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: The minds of the śrāvakas and pratyekabuddhas, as well as the minds of the lord buddhas, would also be free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.” “

source: །རབ་འབྱོར་གྱིས་སྨྲས་པ། དེ་ཡིན་ཏེ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་སེམས་ཀྱང་། རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: It is so, Venerable Śāradvatīputra,” replied Subhūti, “the minds of ordinary persons are also free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.

source: །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་སེམས་ཀྱང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: The minds of the śrāvakas and pratyekabuddhas are also free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་ཀྱང་། རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ། །སྨྲས་པ།
en: The minds of the lord buddhas are also free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.” “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ལྟ་ཡིན་ན། གཟུགས་ཀྱང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར། ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: Venerable Subhūti, in that case, physical forms would also be free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: Feelings, perceptions, formative predispositions, and consciousness would also be free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence. [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: The causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, would also be free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ། །རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: The attainments], up to and including all-aspect omniscience, would also be free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.” “

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཇི་སྐད་དུ་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: Venerable Śāradvatīputra, it is as you have said!” replied Subhūti. “

source: གཟུགས་ཀྱང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: Physical forms are also free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ།
en: The causal and fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are also free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཟག་པ་མེད་ཅིང་ཁོངས་སུ་ཆུད་པ་མེད་དོ། །སྨྲས་པ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གང་ཡང་ཁྱོད་ཀྱིས་འདི་སྐད་དུ། སེམས་མེད་པའི་ཕྱིར།
en: The attainments], up to and including all-aspect omniscience, are also free from contaminants and excluded [from the three realms], owing to the emptiness of inherent existence.” “

source: སེམས་དེ་ལ་ཡང་ཆགས་པ་མེད་དོ་ཞེས་སྨྲས་པ་ནི་དེ་ལྟ་ཡིན་ཏེ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེར་ཡང་མ་ཟད་དེ། གཟུགས་མེད་པ་ཡང་གཟུགས་ལ་ཆགས་པ་མེད་དོ། །ཚོར་བ་མེད་པ་དང་། འདུ་ཤེས་མེད་པ་དང་། འདུ་བྱེད་མེད་པ་དང་། རྣམ་པར་ཤེས་པ་མེད་པ་ཡང་རྣམ་པར་ཤེས་པ་ལ་ཆགས་པ་མེད་དོ།
en: Venerable Subhūti, with regard to your comment that there is also no attachment to that mind because the mind is nonexistent, not only that follows, Venerable Subhūti, but nonexistent physical forms would also be without attachment to physical forms, and nonexistent feelings, perceptions, formative predispositions, and consciousness would also be without attachment to consciousness [and the other aggregates].

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱི་བར་དུ་མེད་པ་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་ཆགས་པ་མེད་དོ།
en: Nonexistent [causal attributes], up to and including the factors conducive to enlightenment, would also be without attachment to the factors conducive to enlightenment [and so forth].

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་མེད་པ་ཡང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་ཆགས་པ་མེད་དོ།
en: Nonexistent [fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, would also be without attachment to the eighteen distinct qualities of the buddhas [and so forth].
